# GeomStepFailedError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..GeomStepFailedError Property
BuiltInFailures..::..RegenFailures Class See Also
---
Can't rebuild geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GeomStepFailedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GeomStepFailedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GeomStepFailedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace